# frozen_string_literal: true

# Homebrew bundle manifest.
#
# Apply:        brew bundle
# Detect drift: brew bundle cleanup             (installed but not declared; no --force = list only)
# Check:        brew bundle check --verbose     (declared but not installed)
#
# Only top-level leaves are tracked; transitive deps are pulled in automatically.
# Third-party tap entries use fully qualified names so explicit `tap` lines are
# unnecessary (brew bundle auto-taps when it sees `user/tap/name`).

# ===== Common =====

# Network Kanji code conversion Filter (NKF)
brew 'nkf'
# GNU File, Shell, and Text utilities
brew 'coreutils'
# Collection of GNU find, xargs, and locate
brew 'findutils'
# GNU implementation of the famous stream editor
brew 'gnu-sed'
# GNU version of the tar archiving utility
brew 'gnu-tar'
# GNU implementation of time utility
brew 'gnu-time'
# GNU grep, egrep and fgrep
brew 'grep'
# Collection of tools that nobody wrote when UNIX was young
brew 'moreutils'
# Executes a program periodically, showing output fullscreen
brew 'watch'

# ===== File search & monitoring =====

# Simple, fast and user-friendly alternative to find
brew 'fd'
# Monitor a directory for changes and run a shell command
brew 'fswatch'
# Watch files and take action when they change
brew 'watchman'

# ===== Git =====

# Distributed revision control system
brew 'git'
# Prevents you from committing sensitive information to a git repo
brew 'git-secrets'
# Access GitHub's .gitignore boilerplates
brew 'gibo'
# Text interface for Git repositories
brew 'tig'

# ===== Security / encryption =====

# Simple, modern, secure file encryption
brew 'age'
# Cryptographic recipes and primitives for Python
brew 'cryptography'
# Editor of encrypted files
brew 'sops'

# ===== Containers & Kubernetes =====

# Container runtimes on MacOS (and Linux) with minimal setup
brew 'colima'
# Create and run Linux containers using lightweight virtual machines
brew 'container'
# Pack, ship and run any application as a lightweight container
brew 'docker'
# Docker CLI plugin for extended build capabilities with BuildKit
brew 'docker-buildx'
# Isolated development environments using Docker
brew 'docker-compose'
# Kubernetes command-line interface
brew 'kubernetes-cli'
# Configuration helper for talos clusters
brew 'talhelper'
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew 'siderolabs/tap/talosctl'

# ===== Language servers =====

# General purpose Language Server
brew 'efm-langserver'
# Terraform Language Server
brew 'hashicorp/tap/terraform-ls'

# ===== Networking =====

# Easiest, most secure way to use WireGuard and 2FA
brew 'tailscale'

# ===== Media / image / audio / video =====

# Asciicast to GIF converter
brew 'agg'
# Record and share terminal sessions
brew 'asciinema'
# Play, record, convert, and stream select audio and video codecs
brew 'ffmpeg'
# Tools and libraries to manipulate images in many formats
brew 'imagemagick-full', link: true
# Unified display of technical and tag data for audio/video
brew 'media-info'

# ===== Terminal / shell =====

# Terminal multiplexer
brew 'tmux'

# ===== macOS-specific =====

# PAM module for reattaching to the user's GUI (Aqua) session
brew 'pam-reattach'
# Send macOS User Notifications from the command-line
brew 'terminal-notifier'

# ===== AI / LLM =====

# Create, run, and share large language models (LLMs)
brew 'ollama', link: false
# AI coding agent, built for the terminal
brew 'opencode'
# Fuzzy-search Claude Code conversation history from the terminal
brew 'raine/claude-history/claude-history'
# Local browser-based review tool for AI agent code changes
brew 'crit'

# ===== Third-party utilities =====

# Google CLI for Gmail, Calendar, Drive, Docs, Sheets, and more
brew 'openclaw/tap/gogcli'

# ===== Casks =====

# Terminal emulator that uses platform-native UI and GPU acceleration
cask 'ghostty'
# Mac OS X Japanese input method based on SKK
cask 'aquaskk'
# Command-line interface for 1Password
cask '1password/tap/1password-cli'
# AI coding agent (desktop)
cask 'codex'
# Set of tools to manage resources and applications hosted on Google Cloud
cask 'gcloud-cli'
# Screen capture utility
cask 'cleanshot'
# Cross-platform text expander
cask 'espanso/espanso/espanso'
# Knowledge base on a local folder of plain text Markdown files
cask 'obsidian'
# Team communication and collaboration software
cask 'slack'
# Tool for powerful automation of macOS
cask 'hammerspoon'
# Powerful menu bar manager
cask 'jordanbaird-ice'
# System monitor for the menu bar
cask 'stats'
# Screencast tool with keystroke visualization
cask 'keycastr'
# PDF and PostScript reader
cask 'skim'
# Network protocol analyzer
cask 'wireshark-app'

# ===== Casks: fonts =====

# HackGen Nerd Font
cask 'font-hackgen-nerd'
# Inconsolata font
cask 'font-inconsolata'

# --- role overlay ---
# `brew bundle` sanitizes PATH, so invoke `dot` by absolute path.
# realpath resolves the ~/.config/homebrew/Brewfile symlink to the dotfiles
# repo; __dir__ would not, so do not let rubocop fold this into __dir__.
brewfile_real = File.realpath(__FILE__)
dotfiles_dir = File.expand_path('../../..', brewfile_real)
overlay = `#{dotfiles_dir}/config/bin/dot role overlay config/homebrew/Brewfile`.strip
instance_eval(File.read(overlay), overlay) if !overlay.empty? && File.exist?(overlay)
