{
  "caw.vim": { "branch": "master" },
  "committia.vim": { "branch": "master" },
  "copilot.vim": { "branch": "release" },
  "diffview.nvim": { "branch": "main" },
  "editorconfig-vim": { "branch": "master" },
  "efmls-configs-nvim": { "branch": "main" },
  "emmet-vim": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "hop.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "markdown-preview.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "neogit": { "branch": "master" },
  "nerdtree": { "branch": "master" },
  "nerdtree-git-plugin": { "branch": "master" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-base16": { "branch": "master" },
  "nvim-ghost.nvim": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-endwise": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "switch.vim": { "branch": "main" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "ultisnips": { "branch": "master" },
  "vim-asterisk": { "branch": "master" },
  "vim-cursorword": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-github-link": { "branch": "master" },
  "vim-go": { "branch": "master" },
  "vim-jqplay": { "branch": "master" },
  "vim-jsonnet": { "branch": "master" },
  "vim-markdown": { "branch": "master" },
  "vim-operator-case": { "branch": "master" },
  "vim-operator-replace": { "branch": "master" },
  "vim-operator-sort": { "branch": "master" },
  "vim-operator-surround": { "branch": "master" },
  "vim-operator-user": { "branch": "master" },
  "vim-prisma": { "branch": "main" },
  "vim-rails": { "branch": "master" },
  "vim-terraform": { "branch": "master" },
  "vim-textobj-between": { "branch": "master" },
  "vim-textobj-blockwise": { "branch": "master" },
  "vim-textobj-comment": { "branch": "master" },
  "vim-textobj-indent": { "branch": "master" },
  "vim-textobj-multiblock": { "branch": "master" },
  "vim-textobj-parameter": { "branch": "master" },
  "vim-textobj-ruby": { "branch": "master" },
  "vim-textobj-syntax": { "branch": "master" },
  "vim-textobj-user": { "branch": "master" }
}