tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "rhysd/hgrep", "https://github.com/rhysd/hgrep"
tap "xorpse/formulae"
brew "act"
brew "ansible"
brew "bat"
brew "glib"
brew "python@3.9"
brew "coreutils"
brew "direnv"
brew "exa"
brew "harfbuzz"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "gitui"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "htmlq"
brew "imagemagick"
brew "jo"
brew "jq"
brew "jsonnet"
brew "media-info"
brew "mitmproxy"
brew "neovim"
brew "nghttp2"
brew "nkf"
brew "node"
brew "pup"
brew "pyenv"
brew "python-yq"
brew "q"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "volta"
brew "youtubeuploader"
brew "zbar"
brew "koekeishiya/formulae/skhd"
brew "rhysd/hgrep/hgrep"
brew "xorpse/formulae/yabai", args: ["HEAD"]
cask "docker"
cask "font-inconsolata"
cask "iterm2"
cask "stats"
cask "wireshark"
cask "xld"
